{
  "BTC": {
    "symbol": "BTC",
    "name": "Bitcoin",
    "chain": "Bitcoin",
    "description": "Bitcoin is the world's first decentralized cryptocurrency, created in 2009 by the pseudonymous Satoshi Nakamoto. It enables peer-to-peer electronic cash transactions without intermediaries like banks or governments, operating on a blockchain secured by Proof of Work mining and the SHA-256 cryptographic algorithm. \r\n\r\nWith a fixed supply cap of 21 million coins and programmatic halvings every four years that reduce miner rewards, Bitcoin is designed as a deflationary digital asset often called \"digital gold.\" Its value stems from solving the double-spending problem without trusted intermediaries, creating the first truly scarce digital asset with censorship resistance and permissionless access that no government, corporation, or individual can control.\r\n\r\nBitcoin operates as a decentralized peer-to-peer network where transactions are recorded on a public ledger called the blockchain, distributed across thousands of computers globally. Transactions are grouped into blocks added approximately every 10 minutes through mining, where specialized computers compete to solve complex mathematical puzzles. \r\n\r\nBitcoin has achieved mainstream adoption through multiple vectors. The January 2024 SEC approval of 11 spot Bitcoin ETFs opened Bitcoin investment to traditional finance participants, and corporations like Strategy (formerly MicroStrategy) are using Bitcoin as a treasury reserve asset to protect against currency debasement, offering MSTR holders amplified exposure to Bitcoin. \r\n\r\nThe Bitcoin ecosystem continues to evolve with innovations like Ordinals, which emerged in January 2023 to enable NFT-like functionality directly on Bitcoin, and BRC-20 tokens, an experimental standard for creating fungible tokens using Ordinal inscriptions. BTCFi (Bitcoin Finance) represents emerging financial applications extending beyond Bitcoin's traditional role, with protocols like Babylon allowing Bitcoin holders to stake BTC to secure Proof of Stake chains. ",
    "circulating_supply": 19970625.0,
    "total_supply": 19970625.0,
    "max_supply": 21000000.0,
    "market_cap_usd": 1795595584955,
    "all_time_high": 126080,
    "all_time_low": 67.81,
    "cached_at": "2026-01-02T20:57:32.623953"
  },
  "ETH": {
    "symbol": "ETH",
    "name": "Ethereum",
    "chain": "Ethereum",
    "description": "Ethereum is a global, open-source platform for decentralized applications. In other words, it is a decentralized blockchain platform that enables developers to build and deploy smart contracts and applications without central authority control. Unlike Bitcoin, which primarily functions as digital currency, Ethereum operates as a programmable global computer where developers can create any type of decentralized service. \r\n\r\nThe platform hosts over $14 billion in DeFi applications with hundreds of thousands of active users across financial protocols, NFT marketplaces, and gaming platforms. Its transition to Proof of Stake in September 2022 reduced energy consumption by over 99%, addressing environmental concerns while strengthening network security.\r\n\r\nThe network operates through thousands of independent validator nodes that process transactions and execute smart contracts on the Ethereum Virtual Machine. Smart contracts are self-executing programs written in Solidity that automatically carry out agreements when conditions are met, eliminating intermediaries like banks or brokers. \r\n\r\nValidators stake ETH as collateral to propose and validate blocks, earning rewards for honest participation while facing penalties for malicious behavior. The EIP-1559 upgrade introduced a dynamic base fee mechanism that burns ETH with each transaction, creating deflationary pressure during high network activity when more ETH is burned than issued to validators.\r\n\r\nVitalik Buterin proposed Ethereum in 2013, but seven co-founders helped build it, including Gavin Wood who created Solidity and the EVM technical specification, and Joseph Lubin who founded ConsenSys. The project launched in July 2015 after raising over $18 million through crowdfunding, quickly becoming the largest blockchain developer community. Major milestones include the 2020 Beacon Chain launch, the 2021 London hard fork implementing fee burning, and the 2022 Merge to Proof of Stake. \r\n\r\nEther (ETH) serves multiple functions: paying transaction fees (gas), staking to secure the network and earn 3-5% annual yields, serving as collateral in DeFi protocols, and purchasing NFTs and digital assets. The asset is increasingly adopted by traditional institutions, with publicly traded companies adding ETH to corporate treasuries to generate staking yields while maintaining blockchain exposure, and in 2024, the SEC approved spot Ethereum ETFs, allowing traditional investors to gain exposure through conventional brokerage accounts.\r\n\r\nEthereum's roadmap focuses on dramatically increasing transaction capacity to over 100,000 per second, reducing confirmation times, and enhancing decentralization while maintaining security against future threats like quantum computing.",
    "circulating_supply": 120694892.5585735,
    "total_supply": 120694892.5585735,
    "max_supply": null,
    "market_cap_usd": 376739394272,
    "all_time_high": 4946.05,
    "all_time_low": 0.432979,
    "cached_at": "2026-01-02T20:57:36.829104"
  },
  "BNB": {
    "symbol": "BNB",
    "name": "BNB",
    "chain": "Binance Smart Chain",
    "description": "Binance Coin is the cryptocurrency of the Binance platform. It is a trading platform exclusively for cryptocurrencies. The name \"Binance\" is a combination of binary and finance.\r\n\r\nThus, the startup name shows that only cryptocurrencies can be traded against each other. It is not possible to trade crypto currencies against Fiat. The platform achieved an enormous success within a very short time and is focused on worldwide market with Malta headquarters. The cryptocurrency currently has a daily trading volume of 1.5 billion - 2 billion US dollars and is still increasing.\r\n\r\nIn total, there will only be 200 million BNBs. Binance uses the ERC20 token standard from Ethereum and has distributed it as follow: 50% sold on ICO, 40% to the team and 10% to Angel investors. The coin can be used to pay fees on Binance. These include trading fees, transaction fees, listing fees and others. Binance gives you a huge discount when fees are paid in BNB. \r\n\r\nThe schedule of BNB fees discount is as follow: In the first year, 50% discount on all fees, second year 25% discount, third year 12.5% discount, fourth year 6.75 % discount, and from the fifth year onwards there is no discount. This structure is used to incentivize users to buy BNB and do trades within Binance.\r\n\r\nBinance announced in a buyback plan that it would buy back up to 100 million BNB in Q1 2018. The coins are then burned. This means that they are devaluated to increase the value of the remaining coins. This benefits investors. In the future, the cryptocurrency will remain an asset on the trading platform and will be used as gas.\r\n\r\nOther tokens that are issued by exchanges include Bibox Token, OKB, Huobi Token, and more.",
    "circulating_supply": 137734498.26,
    "total_supply": 137734498.26,
    "max_supply": 200000000.0,
    "market_cap_usd": 121259681492,
    "all_time_high": 1369.99,
    "all_time_low": 0.0398177,
    "cached_at": "2026-01-02T20:57:41.124693"
  },
  "ADA": {
    "symbol": "ADA",
    "name": "Cardano",
    "chain": "Cardano",
    "description": "Cardano is a blockchain platform built on academic research that enables smart contracts and decentralized applications while using significantly less energy than traditional cryptocurrencies like Bitcoin. \r\n\r\nWhat sets Cardano apart is its methodical, research-driven approach — every major feature is peer-reviewed by scientists and cryptographers before being added to the network. This careful process aims to create a more secure and stable foundation compared to platforms that prioritize speed over thorough testing. The platform's native cryptocurrency, ADA, is used to send money, pay transaction fees, and participate in network governance.\r\n\r\nCardano uses a proof-of-stake system to process transactions, which works differently from Bitcoin's mining approach. Instead of competing to solve complex puzzles, users can \"stake\" their ADA — essentially locking it up temporarily — to become validators who verify transactions. The system selects validators based on how much ADA they've staked and for how long, then rewards them with additional ADA for their participation. This approach uses far less energy than traditional mining while keeping the network secure. The platform also features a two-layer design that separates basic payment transactions from smart contract operations, allowing each function to be optimized independently for better performance. \r\n\r\nADA holders can earn staking rewards by locking up their tokens to help secure the network, vote on proposed changes to the platform, and use ADA for international money transfers with lower fees than traditional services.\r\n\r\nCardano was founded in 2017 by Charles Hoskinson, who previously helped create Ethereum. Hoskinson leads Input Output Global (IOG), the technology company that builds and maintains Cardano's core software. The ecosystem operates through three organizations: IOG handles technical development, the Cardano Foundation promotes adoption and standardization, and Emurgo helps businesses integrate blockchain technology into their operations. This structure distributes responsibilities across multiple groups rather than concentrating control in a single entity. \r\n\r\nIn February 2025, major asset manager Grayscale Investments filed to create an exchange-traded fund (ETF) for Cardano with the U.S. Securities and Exchange Commission, which would allow traditional investors to buy ADA through their regular brokerage accounts without needing to set up cryptocurrency wallets.Retry",
    "circulating_supply": 36669617499.12329,
    "total_supply": 45000000000.0,
    "max_supply": 45000000000.0,
    "market_cap_usd": 14212632142,
    "all_time_high": 3.09,
    "all_time_low": 0.01925275,
    "cached_at": "2026-01-02T21:24:27.895708"
  },
  "SOL": {
    "symbol": "SOL",
    "name": "Solana",
    "chain": "Solana",
    "description": "Solana is a highly functional open source project that banks on blockchain technology’s permissionless nature to provide decentralized finance (DeFi) solutions. It is a layer 1 network that offers fast speeds and affordable costs. While the idea and initial work on the project began in 2017, Solana was officially launched in March 2020 by the Solana Foundation with headquarters in Geneva, Switzerland.",
    "circulating_supply": 563155235.1136764,
    "total_supply": 617409047.4586456,
    "max_supply": null,
    "market_cap_usd": 74145877184,
    "all_time_high": 293.31,
    "all_time_low": 0.500801,
    "cached_at": "2026-01-02T21:32:01.934473"
  },
  "XRP": {
    "symbol": "XRP",
    "name": "XRP",
    "chain": "Ripple",
    "description": "Ripple is the catchall name for the cryptocurrency platform, the transactional protocol for which is actually XRP, in the same fashion as Ethereum is the name for the platform that facilitates trades in Ether. Like other cryptocurrencies, Ripple is built atop the idea of a distributed ledger network which requires various parties to participate in validating transactions, rather than any singular centralized authority. That facilitates transactions all over the world, and transfer fees are far cheaper than the likes of bitcoin. Unlike other cryptocurrencies, XRP transfers are effectively immediate, requiring no typical confirmation time.\r\n\r\nRipple was originally founded by a single company, Ripple Labs, and continues to be backed by it, rather than the larger network of developers that continue bitcoin’s development. It also doesn’t have a fluctuating amount of its currency in existence. Where bitcoin has a continually growing pool with an eventual maximum, and Ethereum theoretically has no limit, Ripple was created with all of its 100 billion XRP tokens right out of the gate. That number is maintained with no mining and most of the tokens are owned and held by Ripple Labs itself — around 60 billion at the latest count.\r\n\r\nEven at the recently reduced value of around half a dollar per XRP, that means Ripple Labs is currently sitting on around $20 billion worth of the cryptocurrency (note: Ripple’s price crashed hard recently, and may be worth far less than $60 billion by time you read this). It holds 55 billion XRP in an escrow account, which allows it to sell up to a billion per month if it so chooses in order to fund new projects and acquisitions. Selling such an amount would likely have a drastic effect on the cryptocurrency’s value, and isn’t something Ripple Labs plans to do anytime soon.\r\n\r\nIn actuality, Ripple Labs is looking to leverage the technology behind XRP to allow for faster banking transactions around the world. While Bitcoin and other cryptocurrencies are built on the idea of separating financial transactions from the financial organizations of traditional currencies, Ripple is almost the opposite in every sense.\r\n\r\nXRP by Ripple price can be found on this page alongside the market capitalization and additional stats.\r\n\r\n",
    "circulating_supply": 60676393849.0,
    "total_supply": 99985734415.0,
    "max_supply": 100000000000.0,
    "market_cap_usd": 120758547253,
    "all_time_high": 3.65,
    "all_time_low": 0.00268621,
    "cached_at": "2026-01-02T21:32:02.248299"
  },
  "MATIC": {
    "symbol": "MATIC",
    "name": "MATIC (migrated to POL)",
    "chain": "Polygon",
    "description": "Polygon (Previously Matic Network) is the first well-structured, easy-to-use platform for Ethereum scaling and infrastructure development. Its core component is Polygon SDK, a modular, flexible framework that supports building multiple types of applications.\r\n\r\nUsing Polygon, one can create Optimistic Rollup chains, ZK Rollup chains, stand alone chains or any other kind of infra required by the developer. \r\n\r\nPolygon effectively transforms Ethereum into a full-fledged multi-chain system (aka Internet of Blockchains). This multi-chain system is akin to other ones such as Polkadot, Cosmos, Avalanche etc with the advantages of Ethereum’s security, vibrant ecosystem and openness.\r\n\r\nNothing will change for the existing ecosystem built on the Plasma-POS chain. With Polygon, new features are being built around the existing proven technology to expand the ability to cater to diverse needs from the developer ecosystem. Polygon will continue to develop the core technology so that it can scale to a larger ecosystem. \r\n\r\nThe $MATIC token will continue to exist and will play an increasingly important role, securing the system and enabling governance.",
    "circulating_supply": 0.0,
    "total_supply": 10000000000.0,
    "max_supply": 10000000000.0,
    "market_cap_usd": null,
    "all_time_high": 2.92,
    "all_time_low": 0.00314376,
    "cached_at": "2026-01-02T21:34:02.566946"
  },
  "LINK": {
    "symbol": "LINK",
    "name": "Chainlink",
    "chain": "Ethereum",
    "description": "Chainlink is the industry-standard decentralized oracle network that solves the \"oracle problem\" by connecting smart contracts with real-world data. Blockchains cannot access external information on their own, so Chainlink acts as a secure bridge, enabling smart contracts to react to real-world events using verified, tamper-proof data. It is widely considered one of the first decentralized oracle networks and is the market leader in bringing off-chain data on-chain.\r\n\r\nThe platform operates through a decentralized network of nodes that fetch, validate, and deliver data to smart contracts. When a contract requests information like a stock price, a committee of independent nodes retrieves and aggregates the data to reach consensus, then delivers a single trustworthy answer. Chainlink offers a suite of services including Data Feeds for asset prices, CCIP for cross-chain token transfers and messaging, Automation for triggering smart contract functions, and Proof of Reserve for verifying asset collateralization.\r\n\r\nChainlink has established itself as critical infrastructure for both DeFi and institutional adoption, with partnerships including Swift, Euroclear, Mastercard, UBS, ANZ, Fidelity International, and J.P. Morgan. Its institutional products include the Chainlink Runtime Environment for tokenized asset workflows, Confidential Compute for privacy-preserving computation, and the Automated Compliance Engine for embedding regulatory rules into smart contracts.\r\n\r\nThe LINK token is the native asset used to pay node operators for services, fund subscription accounts, and incentivize network security through staking. Node operators stake LINK as collateral, which can be slashed if they provide inaccurate data. Chainlink was co-founded in 2017 by Sergey Nazarov and Steve Ellis, who co-authored the white paper with Ari Juels, and raised $32 million in its September 2017 ICO.",
    "circulating_supply": 708099970.4525867,
    "total_supply": 1000000000.0,
    "max_supply": 1000000000.0,
    "market_cap_usd": 9393847028,
    "all_time_high": 52.7,
    "all_time_low": 0.148183,
    "cached_at": "2026-01-02T21:34:22.847709"
  },
  "UNI": {
    "symbol": "UNI",
    "name": "Uni",
    "chain": "Unknown",
    "description": "Uni is a playful and community-driven crypto project on the Sui blockchain, drawing inspiration from Evan Cheng’s beloved dog, Uni, who embodies loyalty, joy, and a spirit of adventure. Built to create a unique ecosystem that promotes fun and accessibility in the world of decentralized finance (DeFi), Uni combines the lightheartedness of its mascot with serious blockchain technology.\r\n\r\nKey Features:\r\n\r\nCommunity-Centric Approach: Uni prioritizes its community, offering various incentives like staking rewards, airdrops, and fun interactive events that strengthen the bond between users.\r\n\r\nUtility &amp; Tokenomics: The $UNI token powers the platform, allowing holders to participate in governance, earn rewards, and access exclusive content, with deflationary mechanics to ensure long-term value.\r\n\r\nNFT Integration: Uni features limited-edition NFTs inspired by the project's mascot, with unique utilities such as staking bonuses, special privileges, and access to future events in the Uni metaverse.\r\n\r\nCross-Chain Capabilities: While natively built on Sui, Uni plans to expand its interoperability with other blockchains, aiming for a multichain future that seamlessly integrates with other DeFi ecosystems.",
    "circulating_supply": 1000000000.0,
    "total_supply": 1000000000.0,
    "max_supply": 1000000000.0,
    "market_cap_usd": 113546,
    "all_time_high": 0.03712406,
    "all_time_low": 6.919e-05,
    "cached_at": "2026-01-02T21:34:43.120472"
  },
  "USDT": {
    "symbol": "USDT",
    "name": "Tether",
    "chain": "Unknown",
    "description": "Tether (USDT) is a cryptocurrency with a value meant to mirror the value of the U.S. dollar. The idea was to create a stable cryptocurrency that can be used like digital dollars. Coins that serve this purpose of being a stable dollar substitute are called “stable coins.” Tether is the most popular stable coin and even acts as a dollar replacement on many popular exchanges! According to their site, Tether converts cash into digital currency, to anchor or “tether” the value of the coin to the price of national currencies like the US dollar, the Euro, and the Yen. Like other cryptos it uses blockchain. Unlike other cryptos, it is [according to the official Tether site] “100% backed by USD” (USD is held in reserve). The primary use of Tether is that it offers some stability to the otherwise volatile crypto space and offers liquidity to exchanges who can’t deal in dollars and with banks (for example to the sometimes controversial but leading exchange Bitfinex).\r\n\r\nThe digital coins are issued by a company called Tether Limited that is governed by the laws of the British Virgin Islands, according to the legal part of its website. It is incorporated in Hong Kong. It has emerged that Jan Ludovicus van der Velde is the CEO of cryptocurrency exchange Bitfinex, which has been accused of being involved in the price manipulation of bitcoin, as well as tether. Many people trading on exchanges, including Bitfinex, will use tether to buy other cryptocurrencies like bitcoin. Tether Limited argues that using this method to buy virtual currencies allows users to move fiat in and out of an exchange more quickly and cheaply. Also, exchanges typically have rocky relationships with banks, and using Tether is a way to circumvent that.\r\n\r\nUSDT is fairly simple to use. Once on exchanges like Poloniex or Bittrex, it can be used to purchase Bitcoin and other cryptocurrencies. It can be easily transferred from an exchange to any Omni Layer enabled wallet. Tether has no transaction fees, although external wallets and exchanges may charge one. In order to convert USDT to USD and vise versa through the Tether.to Platform, users must pay a small fee. Buying and selling Tether for Bitcoin can be done through a variety of exchanges like the ones mentioned previously or through the Tether.to platform, which also allows the conversion between USD to and from your bank account.\r\n\r\n",
    "circulating_supply": 187101343451.7006,
    "total_supply": 192568280005.6362,
    "max_supply": null,
    "market_cap_usd": 187012357114,
    "all_time_high": 1.32,
    "all_time_low": 0.572521,
    "cached_at": "2026-01-02T21:35:03.499576"
  },
  "USDC": {
    "symbol": "USDC",
    "name": "USDC",
    "chain": "Unknown",
    "description": "USDC is a fully collateralized US dollar stablecoin. USDC is the bridge between dollars and trading on cryptocurrency exchanges. The technology behind CENTRE makes it possible to exchange value between people, businesses and financial institutions just like email between mail services and texts between SMS providers. We believe by removing artificial economic borders, we can create a more inclusive global economy.",
    "circulating_supply": 75319785374.33661,
    "total_supply": 75323324988.50194,
    "max_supply": null,
    "market_cap_usd": 75292113070,
    "all_time_high": 1.17,
    "all_time_low": 0.877647,
    "cached_at": "2026-01-02T21:35:23.774318"
  },
  "AVAX": {
    "symbol": "AVAX",
    "name": "Avalanche",
    "chain": "Avalanche",
    "description": "Avalanche is a high throughput smart contract blockchain platform. Validators secure the network through a proof-of-stake consensus protocol. It is said to be fast, low cost, and environmental friendly.",
    "circulating_supply": 431771961.1772119,
    "total_supply": 463441061.1772119,
    "max_supply": 720000000.0,
    "market_cap_usd": 4025665023,
    "all_time_high": 144.96,
    "all_time_low": 2.8,
    "cached_at": "2026-02-26T16:14:53.890662"
  },
  "DOT": {
    "symbol": "DOT",
    "name": "Polkadot",
    "chain": "Polkadot",
    "description": "Polkadot is a platform that allows diverse blockchains to transfer messages, including value, in a trust-free fashion; sharing their unique features while pooling their security. In brief, Polkadot is a scalable heterogeneous multi-chain technology.\r\n\r\nPolkadot is heterogeneous because it is entirely flexible and makes no assumption about the nature or structure of the chains in the network. Even non-blockchain systems or data structures can become parachains if they fulfill a set of criteria.\r\n\r\nPolkadot may be considered equivalent to a set of independent chains (e.g. a set containing Ethereum, Ethereum Classic, Namecoin and Bitcoin) except with important additions: pooled security and trust-free interchain transactability.\r\n\r\nMany of the native parachains of Polkadot will be written using a Polkadot Runtime Environment SDK (e.g. Parity Technologies' Substrate).",
    "circulating_supply": 1669264640.171391,
    "total_supply": 1669264640.171391,
    "max_supply": 2100000000.0,
    "market_cap_usd": 2644778125,
    "all_time_high": 54.98,
    "all_time_low": 1.15,
    "cached_at": "2026-02-26T16:14:54.383581"
  }
}